Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If everything works as expected, you are redirected to the Keycloak server to authenticate. Be aware that the requested path defines a `default` tenant, which we don't have mapped in the configuration file. In this case, the default configuration is used.
ja_jp: すべてが期待どおりに動作する場合、認証のために Keycloak サーバーにリダイレクトされます。 要求されたパスは、設定ファイルでマッピングされていない `default` テナントを定義していることに注意してください。 この場合、デフォルトの設定が使用されます。

source: If false, disable the OpenTelemetry logs handler at *runtime*. This removes the bridge between the Quarkus logging system (JBoss LogManager) and OpenTelemetry logs.
ja_jp: false の場合、 *実行* 時に OpenTelemetry ログハンドラを無効にします。これにより、Quarkus ログシステム (JBoss LogManager) と OpenTelemetry ログ間のブリッジが削除されます。

source: If false, disable the OpenTelemetry tracing usage at *build* time.
ja_jp: false の場合、*ビルド* 時に OpenTelemetry トレースの使用を無効にします。

source: If false, disable the OpenTelemetry usage at *build* time.
ja_jp: false の場合、*ビルド* 時に OpenTelemetry の使用を無効にします。

source: If false, will disable Quarkus default OTLP exporters at *build* time. Telemetry will be generated, contexts will be propagated but no telemetry will be sent out.
ja_jp: false の場合、Quarkus のデフォルト OTLP エクスポーターを *ビルド時* に無効にします。Telemetry は生成され、コンテキストは伝播されますが、Telemetry は送信されません。

source: If fast startup and live reload weren't enough for you, maybe custom extensions will convince you that you can achieve great things with Quarkus.
ja_jp: 高速起動やライブリロードだけでは物足りないという方は、カスタムエクステンションを使えば、Quarkusで素晴らしいことができると納得できるかもしれません。

source: If for any reason additional permissions are required either by the init container or the job, they can be configured with through the xref:deploying-to-kubernetes.adoc#generating-rbac-resources[Kubernetes RBAC configuration].
ja_jp: 何らかの理由でinitコンテナやジョブで追加のパーミッションが必要な場合は、 xref:deploying-to-kubernetes.adoc#generating-rbac-resources[KubernetesのRBAC設定] で設定できます。

source: If for example a custom serializer named `FooSerializer` for type `com.example.Foo` needs to be registered with JSON-B, the addition of a bean like the following would suffice:
ja_jp: 例えば、 `FooSerializer` という名前のカスタムシリアライザを `com.example.Foo` タイプで JSON-B で登録する必要がある場合、以下のような Bean を追加すれば十分です。

source: If for example application code wants to use `Tracer`, but also needs to use a custom `Reporter` bean, such a requirement could easily be done using something like:
ja_jp: 例えば、アプリケーションコードが `Tracer` を使用したいが、カスタムの `Reporter` Bean を使用する必要がある場合、そのような要件は、次のようなものを使用して簡単に行うことができます。

source: If for some reason adding the aforementioned configuration to `application.properties` is not desirable, it is possible to configure the build tool to effectively perform the same operation.
ja_jp: 何らかの理由で `application.properties` に前述の構成を追加することが望ましくない場合には、ビルドツールで効果的に同様の操作を行うように構成することも可能です。

source: If for some reason you cannot use Dev Services, you will have to set the following properties to get similar behavior:
ja_jp: 何らかの理由でDev Servicesを利用できない場合は以下のプロパティを設定することで、同様の動作をさせることができます:

source: If for some reason you must customize the default `ObjectMapper` bean provided by this extension and used by the Kubernetes Client, you can do so by declaring a bean that implements the `KubernetesClientObjectMapperCustomizer` interface.
ja_jp: 何らかの理由で、このエクステンションによって提供され、Kubernetes Clientによって使用されるデフォルトの `ObjectMapper` Beanをカスタマイズする必要がある場合は、 `KubernetesClientObjectMapperCustomizer` インターフェイスを実装するBeanを宣言することでカスタマイズできます。

source: If for some reason you need to parse the config and use it in other build steps in an extension processor, you would need to create an `XmlConfigBuildItem` to pass the parsed XmlConfig instance around.
ja_jp: 何らかの理由で設定を解析し、エクステンションプロセッサーの他のビルドステップで使用する必要がある場合は、解析された XmlConfig インスタンスを渡すために `XmlConfigBuildItem` を作成する必要があります。

source: If for whatever reason, access to the datasource is needed in code, it can be obtained as any other bean in the following manner:
ja_jp: 何らかの理由でコード内でデータソースへのアクセスが必要な場合は、以下の方法で他の Bean と同じようにデータソースを取得することができます。

source: If for whatever reason, the aforementioned solution is deemed unacceptable, there are alternatives.
ja_jp: 何らかの理由で前述の解決策が受け入れられないと判断された場合、代替手段があります。

source: If found, parse using JAXB context for `XmlConfig.class`
ja_jp: 見つかった場合は、JAXB コンテキストを使用して `XmlConfig.class` を解析します。

source: If globs are not sufficiently precise for your use case and you need to rely on regular expressions or if you prefer relying on the GraalVM infrastructure, you can also create a `resources-config.json` (the most common location is within `src/main/resources`) JSON file defining which resources should be included:
ja_jp: グロブが不十分で正規表現に頼る必要がある場合や、GraalVM インフラストラクチャーを使用することを好む場合は、どのリソースを含めるべきかを定義する JSON ファイル `resources-config.json` (最も一般的な場所は `src/main/resources` 内) を作成します。

source: If globs are not sufficiently precise for your use case and you need to rely on regular expressions, or if you prefer relying on the GraalVM infrastructure, you can also create a `resource-config.json` JSON file defining which resources should be included. This, and other native image configuration files, should be placed under the `src/main/resources/META-INF/native-image/<group-id>/<artifact-id>` folder. This way they will be automatically parsed by the native build, without additional configuration.
ja_jp: globs ではユースケースに十分な精度がなく、正規表現に頼る必要がある場合、または GraalVM インフラストラクチャーに頼ることを好む場合は、 また、含めるリソースを定義する `resource-config.json` JSON ファイルを作成することもできます。 これと他のネイティブイメージ設定ファイルは、 `src/main/resources/META-INF/native-image/<group-id>/<artifact-id> フォルダーに配置する必要があります。 こうすることで、追加の設定なしでネイティブビルドによって自動的に解析されます。

source: If globs are not sufficiently precise for your use case and you need to rely on regular expressions, or if you prefer relying on the GraalVM infrastructure, you can also create a `resources-config.json` (the most common location is within `src/main/resources`) JSON file defining which resources should be included.
ja_jp: グロブの精度が十分でなく、正規表現に頼る必要がある場合、または GraalVM インフラストラクチャに頼ることを好む場合は、 `resources-config.json` （最も一般的な場所は `src/main/resources` 内）JSON ファイルを作成して、どのリソースを含めるかを定義することもできます。

source: If globs are not sufficiently precise for your use case and you need to rely on regular expressions, or if you prefer relying on the GraalVM infrastructure, you can also create a `resources-config.json` (the most common location is within `src/main/resources`) JSON file defining which resources should be included:
ja_jp: グロブでは不十分で正規表現に頼る必要があるユースケースや、GraalVM インフラストラクチャーを使用することを好む場合は、どのリソースを含めるべきかを定義する JSON ファイル `resources-config.json` (最も一般的な場所は `src/main/resources` 内) を作成します:

source: If high allocation values are reported, there are 2 ways to determine whether it’s a real memory leak:
ja_jp: 高い割り当て値が報告された場合、それが実際のメモリーリークであるかどうかを判断する方法は 2 つあります。

source: If however a filter needs to be run on the event-loop despite the fact that the method servicing the request will be run on a worker thread, then `@ServerRequestFilter(nonBlocking=true)` can be used. Note however, that these filters need to be run before **any** filter that does not use that setting and would run on a worker thread.
ja_jp: しかし、リクエストを処理するメソッドがワーカスレッドで実行されるにも関わらず、フィルターをイベントループで実行する必要がある場合、 `@ServerRequestFilter (nonBlocking=true)` を使用することができます。しかし、これらのフィルターはこの設定を使わず、ワーカースレッドで実行される **どんな** フィルターよりも前に実行される必要があることに注意してください。

source: If in the DTO projection object you have a field from a referenced entity, you can use the `@ProjectedFieldName` annotation to provide the path for the SELECT statement.
ja_jp: DTO射影のオブジェクトから参照されるエンティティのフィールドがある場合、 `@ProjectedFieldName` アノテーションを使用してSELECT文のパスを提供することができます。

source: If installing UPX is not an option for you, you can ask Quarkus to build your native executable using an in-container build (with `-Dquarkus.native.container-build=true`). You will get a Linux 64 bits executable (perfect for containers but unusable from your machine if you don't use Linux). The in-container build provides UPX so that it can compress the executable. When using an in-container build, you don't need GraalVM or UPX on your machine. This option is particularly interesting on CI.
ja_jp: UPXをインストールすることができない場合は、Quarkusにコンテナ内ビルド（ `-Dquarkus.native.container-build=true` ）を使用してネイティブ実行可能ファイルをビルドするように依頼することができます。Linux 64ビットの実行可能ファイルが得られます（コンテナには最適ですが、Linuxを使用していない場合は自分のマシンからは使用できません）。コンテナ内ビルドでは、実行可能ファイルを圧縮できるように UPX を提供しています。コンテナ内ビルドを使用する場合は、あなたのマシンにGraalVMやUPXは必要ありません。このオプションは、特にCI上で興味深いものです。

source: If instead of cancelling the pipeline, it should be completed regardless of the state of the HTTP connection, Quarkus REST provides the `org.jboss.resteasy.reactive.server.Cancellable` annotation which can be applied to REST classes or methods to control the cancellation behavior.
ja_jp: パイプラインをキャンセルする代わりに、HTTP 接続の状態に関わらず完了させる必要がある場合、Quarkus REST は `org.jboss.resteasy.reactive.server.Cancellable` アノテーションを提供しており、これを REST クラスまたはメソッドに適用してキャンセル動作を制御できます。

source: If instead you are using RESTEasy Reactive via the `quarkus-resteasy-reactive` extension, then in your `pom.xml` file, add:
ja_jp: 代わりに `quarkus-resteasy-reactive` エクステンションを介して RESTEasy Reactive を使用している場合は、 次を `pom.xml` ファイルに追加してください。

source: If instead you are using the legacy RESTEasy Classic-based `quarkus-resteasy` extension, then in your `pom.xml` file, add:
ja_jp: 従来の RESTEasy Classic ベースの `quarkus-resteasy` エクステンションを使用している場合は、`pom.xml` ファイルに以下を追加します。

source: If instead, it is required that the `RealTracer` bean is only used if the `some.tracer.enabled` property is not `false`, then `@UnlessBuildProperty` would be ideal. The code would look like:
ja_jp: 代わりに、 `some.tracer.enabled` プロパティーが `false` でない場合にのみ `RealTracer` Bean が使用されることが要求される場合は、 `@UnlessBuildProperty` が理想的です。コードは以下のようになります。

source: If instead, it is required that the `Tracer` bean also works in dev mode and only default to doing nothing for tests, then `@UnlessBuildProfile` would be ideal. The code would look like:
ja_jp: 代わりに、 `Tracer` Bean も開発モードで動作し、デフォルトではテストのために何もしないことが要求される場合は、 `@UnlessBuildProfile` が理想的です。コードは次のようになります。

source: If instead, it is required that the `Tracer` bean also works in dev-mode and only default to doing nothing for tests, then `@UnlessBuildProfile` would be ideal. The code would look like:
ja_jp: 代わりに、 `Tracer` Bean も dev モードで動作し、デフォルトではテストのために何もしないことが要求される場合は、 `@UnlessBuildProfile` が理想的です。コードは次のようになります。

source: If it adheres to all hard constraints, then it is a _feasible_ solution, for example, a solution with the score `0hard/-7soft`.
ja_jp: すべてのハード制約に準拠している場合、それは _feasible_ ソリューションです。たとえば、スコアが `0hard/-7soft` のソリューションです。

source: If it becomes necessary to test security features using both `@TestSecurity` and Basic Auth (which is the fallback auth mechanism when none is defined), then Basic Auth needs to be enabled explicitly, for example by setting `quarkus.http.auth.basic=true` or `%test.quarkus.http.auth.basic=true`.
ja_jp: `@TestSecurity` と Basic Auth の両方を使ってセキュリティー機能をテストする必要が出てきた場合 (何も定義されていない場合のフォールバック認証メカニズムです)、明示的に有効にする必要があり、 たとえば `quarkus.http.auth.basic=true` や`%test.quarkus.http.auth.basic=true` と設定します。

source: If it breaks hard constraints, then it is an _infeasible_ solution, for example, a solution with the score `-2hard/-3soft`.
ja_jp: ハード制約を破る場合、それは _infeasible_ ソリューションです。たとえば、スコアが `-2hard/-3soft` のソリューションです。

source: If it does not start with any of the above it is ignored by the parser.
ja_jp: 上記のいずれかで始まらない場合は、パーサによって無視されます。

source: If it does not work for you, it could be we missed something or you are using extensions not yet supporting Quarkus 3.
ja_jp: もしうまくいかない場合は、私たちが何か見落としているか、Quarkus 3をサポートしていないエクステンションを使用している可能性があります。

source: If it is configured as a relative path then it is added to the current request URL's host and port to build a resource identifier URL. If it is not configured at all then, unless it is a default tenant id, the tenand id is added to the current request URL's host and port to build a resource identifier URL.
ja_jp: 相対パスとして設定されている場合は、現在のリクエスト URL のホストとポートに追加され、リソース識別子 URL が構築されます。まったく設定されていない場合は、デフォルトのテナント ID でない限り、テナント ID が現在のリクエスト URL のホストとポートに追加され、リソース識別子 URL が構築されます。

source: If it is desirable to simply halt the execution when the archive is not usable, the following command line invocation can be used:
ja_jp: アーカイブが使えなくなったときに、単に実行を停止させたい場合は、以下のようなコマンドラインでの起動が利用可能です。

source: If it is expected that the custom resolvers will always infer a tenant then the default tenant configuration is not needed. One can disable it with the `quarkus.oidc.tenant-enabled=false` setting.
ja_jp: カスタムリゾルバが常にテナントを推論することが予想される場合、デフォルトのテナント設定は必要ありません。 `quarkus.oidc.tenant-enabled=false` の設定で無効にすることができます。

source: If it is set to `true`, when the outgoing message queue is full, the `Send` and `SendAsync` methods of producer block, rather than failing and throwing errors. + If it is set to `false`, when the outgoing message queue is full, the `Send` and `SendAsync` methods of producer fail and `ProducerQueueIsFullError` exceptions occur. The `MaxPendingMessages` parameter determines the size of the outgoing message queue.
ja_jp: `true` に設定した場合、送信メッセージ キューがいっぱいになったときに、プロデューサーの `Send` メソッドと `SendAsync` メソッドは失敗してエラーをスローするのではなく、ブロックされます。+ `false` に設定した場合、送信メッセージ キューがいっぱいになったときに、プロデューサーの `Send` メソッドと `SendAsync` メソッドは失敗し、 `ProducerQueueIsFullError` 例外が発生します。 `MaxPendingMessages` パラメーターは、送信メッセージ キューのサイズを決定します。

source: If it is the case in your production then it can be recommended that the token introspection and `UserInfo` data are cached for a short period of time, for example, for 3 or 5 minutes.
ja_jp: 本番環境でこれに当てはまる場合は、トークンのイントロスペクションと `UserInfo` データを短時間、たとえば 3 - 5 分間キャッシュすることをお勧めします。

source: If it prints something like above, you can use `io_uring`.
ja_jp: もし上記のように表示されたら、 `io_uring` を使用することが可能です。

source: If it's not the right time for you to change your workflow, you can easily go back to the previous packaging by adding the following property to your `application.properties`:
ja_jp: ワークフローを変更するタイミングではない場合は、 `application.properties` に以下のプロパティを追加することで、簡単に以前のパッケージングに戻ることができます。

source: If it's your first time to install, you'll need to restart your shell.
ja_jp: 初めてインストールする場合は、シェルを再起動する必要があります。

source: If lessons are still unassigned, then it is an _uninitialized_ solution, for example, a solution with the score `-4init/0hard/0soft`.
ja_jp: レッスンがまだ割り当てられていない場合、それは _uninitialized_ ソリューションです。たとえば、スコアが `-4init/0hard/0soft` のソリューションです。

source: If managing native image agent configuration files manually, it is highly recommended to regenerate them each time a Mandrel version update occurs, because the configuration necessary to make the application work might have varied due to internal Mandrel changes.
ja_jp: ネイティブイメージエージェント設定ファイルを手動で管理する場合は、 Mandrel のバージョンが更新されるたびに再生成することを強く推奨します。 アプリケーションを動作させるために必要な設定が、Mandrel の内部変更が原因で変化した可能性があるためです。

source: If more than one custom `SecurityIdentityAugmentor` is registered then they will be considered equal candidates and invoked in random order. You can enforce the order by implementing a default `SecurityIdentityAugmentor#priority` method. Augmentors with higher priorities will be invoked first.
ja_jp: 複数のカスタム `SecurityIdentityAugmentor` が登録されている場合、それらは同等の候補とみなされ、ランダムな順序で呼び出されます。デフォルトの `SecurityIdentityAugmentor#priority` メソッドを実装することで順番を強制することができます。優先度の高いAugmentors が最初に起動されます。

source: If more than one scope has to be submitted to the OIDC provider, then a ` ` space character (URL encoded as `%20`) is used to separate multiple scope values, for example, `scope=openid%20scope=read`. Some OAuth2 providers, notably xref:security-openid-connect-providers.adoc#strava[Strava OAuth2] expect a comma `,` separator, thus you can do `quarkus.oidc.authentication.scope-separator=,`, etc.
ja_jp: 複数のスコープを OIDC プロバイダーに送信する必要がある場合は、 ` ` スペース文字 (URL エンコードで `%20`) を使用して複数のスコープ値を区切ります (例: `scope=openid%20scope=read`)。一部の OAuth2 プロバイダー (特に xref:security-openid-connect-providers.adoc#strava[Strava OAuth2]) はカンマ `,` のセパレーターを想定しているため、その場合は `quarkus.oidc.authentication.scope-separator=,` などと設定できます。

source: If multiple JAX-RS applications are defined, the property `quarkus.resteasy.ignore-application-classes=true` can be used to ignore all explicit `Application` classes. This makes all resource-classes available via the application-path as defined by `quarkus.resteasy.path` (default: `/`).
ja_jp: 複数の JAX-RS アプリケーションが定義されている場合、 `quarkus.resteasy.ignoreApplicationClasses=true` プロパティーを使用して、すべての明示的な `Application` クラスを無視することができます。これにより、すべてのリソースクラスが `quarkus.resteasy.path` で定義されたアプリケーションパス ( デフォルトは `/` ) を介して利用できるようになります。

source: If multiple Jakarta REST applications are defined, the property `quarkus.resteasy.ignore-application-classes=true` can be used to ignore all explicit `Application` classes. This makes all resource-classes available via the application-path as defined by `quarkus.resteasy.path` (default: `/`).
ja_jp: 複数の Jakarta REST アプリケーションが定義されている場合、プロパティ `quarkus.resteasy.ignore-application-classes=true` を使用すると、すべての明示的な `Application` クラスを無視することができます。これにより、すべてのリソース・クラスは、 `quarkus.resteasy.path` （デフォルト： `/` ）で定義されるapplication-pathを介して利用可能になります。

source: If multiple `OidcClient` objects are configured, you can specify the `OidcClient` injection target with the `@NamedOidcClient` qualifier instead of working with `OidcClients`:
ja_jp: 複数の `OidcClient` オブジェクトが設定されている場合、 `OidcClients` を使用する代わりに、 `@NamedOidcClient` 修飾子で `OidcClient` 注入ターゲットを指定できます。

source: If multiple permission sets specify the same path and method (or multiple have no method) then both permissions have to allow access for the request to proceed. Note that for this to happen both have to either have specified the method, or have no method, method specific matches take precedence as stated above:
ja_jp: 複数のパーミッションセットが同じパスとメソッドを指定している場合（または複数のパーミッションがメソッドを持たない場合）、リクエストを進めるためには両方のパーミッションがアクセスを許可しなければなりません。これを実現するためには、両方がメソッドを指定しているか、メソッドを持たないかのいずれかでなければならないことに注意してください、メソッド固有のマッチは上記のように優先されます。 :

source: If native image agent is generating a configuration that it’s not working as expected, you should check that the configuration files include the expected information. For example, if some method happens to be accessed via reflection at runtime and you get an error, you want to verify that the configuration file contains a reflection entry for that method.
ja_jp: ネイティブイメージエージェントにより、期待通りに動作しない設定が生成されている場合、 設定ファイルに必要な情報が含まれていることを確認する必要があります。 たとえば、実行時にリフレクションを介してメソッドにアクセスし、エラーが発生した場合、 設定ファイルにそのメソッドのリフレクションエントリーが含まれていることを確認します。

source: If necessary, the CDI request context is activated during execution of the asynchronous code.
ja_jp: 必要であれば、CDIリクエストコンテキストは非同期コードの実行中にアクティブ化されます。

source: If necessary, you can configure Quarkus to restore the original request URI after the authentication has been completed. For example:
ja_jp: 必要に応じて、認証が完了した後に元のリクエスト URI を復元するように Quarkus を設定できます。例:

source: If neither condition is met, an `IllegalStateException` is thrown.
ja_jp: どちらの条件も満たされない場合は、`IllegalStateException` がスローされます。

source: If neither is configured: all operations are *included*.
ja_jp: どちらも設定されていない場合: すべてのオペレーションが *含まれます*。

source: If no Compose services are found, the default Dev Services implementation is used (typically starting a Testcontainers-based service)
ja_jp: Compose サービスが見つからない場合、デフォルトの Dev Services の実装が使用されます (通常は Testcontainers ベースのサービスが起動されます)。

source: If no `[client|consumer|producer]-configuration` is configured, the connector will look for instances identified with the channel name:
ja_jp: `[client|consumer|producer]-configuration` が設定されていない場合、コネクターはチャネル名で識別されるインスタンスを検索します。

source: If no `artifact-id` is specified then all dependencies with the specified `group-id` are indexed.
ja_jp: `artifact-id` が指定されていない場合は、 `group-id` が指定された依存関係はすべてインデックス化されます。

source: If no `schema` property is found, the connector looks for `Schema` beans identified with the channel name. For example, the outgoing channel `a-channel` will use the key/value schema.
ja_jp: `schema` プロパティーが見つからない場合、コネクターはチャネル名で識別される `Schema` Bean を検索します。 たとえば、発信チャネル `a-channel` はキー/値スキーマを使用します。

source: If no compose files are found in the project, and no `quarkus.compose.devservices.project-name` is set, Compose Dev Services won't try to discover any services and will be disabled.
ja_jp: プロジェクト内に Compose ファイルが見つからず、`quarkus.compose.devservices.project-name` が設定されていない場合、Compose Dev Services はサービスを検出を試みず、無効化されます。

source: If no config property with the specified key exists and no default value is set then the application startup fails.
ja_jp: 指定されたキーを持つ設定プロパティーが存在せず、デフォルト値が設定されていない場合、アプリケーションの起動が失敗します。

source: If no content-type header is set then we will try to use the most acceptable content type as defined by `io.vertx.ext.web.RoutingContext.getAcceptableContentType()`.
ja_jp: content-type ヘッダーが設定されていない場合は、 `io.vertx.ext.web.RoutingContext.getAcceptableContentType()` で定義されている最も受け入れやすいコンテンツタイプの使用を試みます。

source: If no content-type header is set, then we will try to use the most acceptable content type by matching the accept header with the value of the `Route` produces attribute as defined by `io.vertx.ext.web.RoutingContext.getAcceptableContentType()`.
ja_jp: もしcontent-typeヘッダーが設定されていなければ、acceptヘッダーを `io.vertx.ext.web.RoutingContext.getAcceptableContentType()` で定義されている `Route` produces属性の値と照合して、最も受け入れやすいコンテンツタイプを使用しようと試みます。

source: If no credentials are configured, the proxy is used without authentication.
ja_jp: クレデンシャルが設定されていない場合、プロキシーは認証なしで使用されます。

source: If no credentials are provided then the mechanism specific challenge is created, for example, `401` status is returned by either `Basic` or `JWT` mechanisms, URL redirecting the user to the OpenID Connect provider is returned by `quarkus-oidc`, etc.
ja_jp: 例えば、 `401` ステータスは `Basic` または `JWT` のいずれかのメカニズムによって返され、ユーザーを `OpenId Connect` プロバイダにリダイレクトする URL は `quarkus-oidc` によって返されるなど、認証情報が提供されない場合はメカニズム固有のチャレンジが作成されます。

source: If no custom realm is imported, Dev Services for Keycloak sets the `redirect_uri` value to `*` when it creates a default realm.
ja_jp: カスタムレルムがインポートされていない場合、Dev Services for Keycloak はデフォルトのレルムを作成するときに `redirect_uri` 値を `*` に設定します。

source: If no default scope is specified the `@Dependent` pseudo-scope is used.
ja_jp: デフォルトスコープが指定されていない場合は `@Dependent` 擬似スコープが使用されます。

source: If no filters and interceptors are invoked when an endpoint is serviced, you can use more efficient message body writers that directly write to vert.x and don’t require reflection and annotations:
ja_jp: エンドポイントがサービスされるときにフィルタやインターセプタが呼び出されない場合、 リフレクションやアノテーションを必要としない、vert.x に直接書き込む、更に効率的なメッセージボディライターを使うことができます。

source: If no introspection endpoint is present, you can instead request <<code-flow-user-info,UserInfo>> from the provider, as it will at least validate the access token. To do so, specify `quarkus.oidc.token.verify-access-token-with-user-info=true`.
ja_jp: イントロスペクションエンドポイントが存在しない場合は、代わりに <<code-flow-user-info,UserInfo>> をプロバイダーにリクエストできます。これにより、少なくともアクセストークンが検証されます。 これを行うには、 `quarkus.oidc.token.verify-access-token-with-user-info=true` を指定します。

source: If no level configuration exists for a given logger category, the enclosing (parent) category is examined. If no categories are configured which enclose the category in question, then the root logger configuration is used.
ja_jp: 与えられたロガー カテゴリにレベル設定が存在しない場合、包含(親)カテゴリが検査されます。対象のカテゴリを囲むカテゴリが設定されていない場合、ルート ロガー設定が使用されます。

source: If no name is explicitly specified by the `value` member the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1#default_name[default name is assigned] - the simple name of the bean class, after converting the first character to lower case. In this particular case, the default name is `userData`.
ja_jp: `value` メンバーによって名前が明示的に指定されていない場合は、https://jakarta.ee/specifications/cdi/4.1/jakarta -cdi-spec-4.1#default_name[デフォルト名が割り当てられます] (最初の文字を小文字に変換した後の Bean クラスの単純な名前)。この特定のケースでは、デフォルト名は `userData` です。
